## Ch 6. 데이터 로딩과 저장, 파일 형식

### txt file

In [10]:
import numpy as np
import pandas as pd
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc("figure", figsize=(10, 6))
pd.options.display.max_colwidth = 75
pd.options.display.max_columns = 20
np.set_printoptions(precision=4, suppress=True)

In [24]:
!type ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [26]:
df = pd.read_csv("ex1.csv")
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [28]:
!type ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [30]:
pd.read_csv("ex2.csv", header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [32]:
pd.read_csv("ex2.csv", names =["a","b","c","d", "message"])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [34]:
names = ["a","b","c","d", "message"]
pd.read_csv("ex2.csv", names=names, index_col = "message")

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [36]:
!type csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [40]:
parsed = pd.read_csv("csv_mindex.csv", index_col = ["key1","key2"])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [42]:
! type ex3.txt

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [46]:
result = pd.read_csv("ex3.txt", sep = "\s+")
result

<>:1: SyntaxWarning: invalid escape sequence '\s'
<>:1: SyntaxWarning: invalid escape sequence '\s'
C:\Users\JuhyunN\AppData\Local\Temp\ipykernel_5380\1821600474.py:1: SyntaxWarning: invalid escape sequence '\s'
  result = pd.read_csv("ex3.txt", sep = "\s+")

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [48]:
! type ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [50]:
pd.read_csv("ex4.csv", skiprows = [0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [52]:
! type ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [54]:
result = pd.read_csv("ex5.csv")
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [56]:
pd.isna(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [60]:
result = pd.read_csv("ex5.csv", na_values =["NULL"])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [62]:
result2 = pd.read_csv("ex5.csv", keep_default_na = False)
result2

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [64]:
result2.isna()

   something      a      b      c      d  message
0      False  False  False  False  False    False
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [66]:
result3 = pd.read_csv("ex5.csv",keep_default_na = False, na_values = ["NA"])
result3

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [68]:
result3.isna()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [70]:
sentinels = {"message": ["foo", "NA"], "something": ["two"]}
pd.read_csv("ex5.csv", na_values = sentinels, keep_default_na = False)

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       NaN  5   6       8   world
2     three  9  10  11  12     NaN

In [72]:
pd.options.display.max_rows = 10
result = pd.read_csv("ex6.csv")
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [74]:
pd.read_csv("ex6.csv", nrows = 5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [78]:
chunker = pd.read_csv("ex6.csv", chunksize = 1000)
type(chunker)

pandas.io.parsers.readers.TextFileReader

In [84]:
chunker = pd.read_csv("ex6.csv", chunksize =1000)

tot = pd.Series([], dtype = 'int64')
for piece in chunker:
    tot = tot.add(piece["key"].value_counts(), fill_value= 0)

tot = tot.sort_values(ascending = False)
tot[:10]

key
E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

#### data -> text

In [87]:
data = pd.read_csv("ex5.csv")
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [89]:
data.to_csv("out.csv")
! type out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [91]:
import sys

In [93]:
data.to_csv(sys.stdout, sep = "|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [95]:
data.to_csv(sys.stdout, na_rep = "NULL")

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [97]:
data.to_csv(sys.stdout, index = False, header = False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [99]:
data.to_csv(sys.stdout, index = False, columns = ["a","b","c"])

a,b,c
1,2,3.0
5,6,
9,10,11.0

#### 다른 구분자 형식

In [102]:
! type ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [104]:
import csv

In [106]:
f = open("ex7.csv")
reader = csv.reader(f)

In [108]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [116]:
f.close()

In [118]:
with open("ex7.csv") as f:
    lines = list(csv.reader(f))

In [120]:
header, values = lines[0], lines[1:]

In [122]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

#### JSON Data

In [127]:
import json

In [129]:
obj = """
{"name": "Wes",
"cities_lived" : ["Akron", "Nashville", "New York", "San Francisco"],
"pet": null,
"siblings": [{"name":"Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
             {"name":"Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
"""

In [131]:
result = json.loads(obj)
result

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [135]:
asjson = json.dumps(result)
asjson

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

In [137]:
siblings = pd.DataFrame(result["siblings"], columns = ["name", "age"])
siblings

    name  age
0  Scott   34
1  Katie   42

In [141]:
! type example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [143]:
data = pd.read_json("example.json")
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [145]:
data.to_json(sys.stdout)

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [147]:
data.to_json(sys.stdout, orient="records")

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [155]:
pip install lxml beautifulsoup4 html5lib

Requirement already satisfied: lxml in c:\anaconda\lib\site-packages (5.2.1)
Requirement already satisfied: beautifulsoup4 in c:\anaconda\lib\site-packages (4.12.3)
Collecting html5lib
  Downloading html5lib-1.1-py2.py3-none-any.whl.metadata (16 kB)
Requirement already satisfied: soupsieve>1.2 in c:\anaconda\lib\site-packages (from beautifulsoup4) (2.5)
Requirement already satisfied: six>=1.9 in c:\anaconda\lib\site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in c:\anaconda\lib\site-packages (from html5lib) (0.5.1)
Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
Installing collected packages: html5lib
Successfully installed html5lib-1.1
Note: you may need to restart the kernel to use updated packages.

In [167]:
tables = pd.read_html("fdic_failed_bank_list.html")
len(tables)

1

In [169]:
failures=tables[0]
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [173]:
close_timestamps = pd.to_datetime(failures["Closing Date"])
close_timestamps.dt.year.value_counts()

Closing Date
2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: count, Length: 15, dtype: int64

In [179]:
from lxml import objectify
path = "Performance_MNR.xml"
with open(path) as f:
    parsed = objectify.parse(f)

root = parsed.getroot()

In [181]:
data =[]
skip_fields = ["PARENT_SEQ","INDICATOR_SEQ","DESIRED_CHANGE","DECIMAL_PLACES"]

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data [child.tag] = child.pyval
    data.append(el_data)

In [183]:
perf = pd.DataFrame(data)
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at their destinations within 5 m...,2008,1,Service Indicators,M,%,95.0,96.9,95.0,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at their destinations within 5 m...,2008,2,Service Indicators,M,%,95.0,96.0,95.0,95.0
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at their destinations within 5 m...,2008,3,Service Indicators,M,%,95.0,96.3,95.0,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at their destinations within 5 m...,2008,4,Service Indicators,M,%,95.0,96.8,95.0,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at their destinations within 5 m...,2008,5,Service Indicators,M,%,95.0,96.6,95.0,95.8

In [185]:
perf2 = pd.read_xml(path)
perf2.head()

,INDICATOR_SEQ,PARENT_SEQ,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,DESIRED_CHANGE,INDICATOR_UNIT,DECIMAL_PLACES,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at their destinations within 5 m...,2008,1,Service Indicators,M,U,%,1,95.00,96.90,95.00,96.90
1,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at their destinations within 5 m...,2008,2,Service Indicators,M,U,%,1,95.00,96.00,95.00,95.00
2,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at their destinations within 5 m...,2008,3,Service Indicators,M,U,%,1,95.00,96.30,95.00,96.90
3,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at their destinations within 5 m...,2008,4,Service Indicators,M,U,%,1,95.00,96.80,95.00,98.30
4,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at their destinations within 5 m...,2008,5,Service Indicators,M,U,%,1,95.00,96.60,95.00,95.80

#### binary data

In [188]:
frame = pd.read_csv("ex1.csv")
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [190]:
pd.read_pickle("frame_pickle")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [192]:
pip install pyarrow

Requirement already satisfied: pyarrow in c:\anaconda\lib\site-packages (16.1.0)
Requirement already satisfied: numpy>=1.16.6 in c:\anaconda\lib\site-packages (from pyarrow) (1.26.4)
Note: you may need to restart the kernel to use updated packages.

fec = pd.read_parquet("fec/fec.parquet") #오류남

#### Microsoft excel file

In [199]:
pip install openpyxl xlrd

Requirement already satisfied: openpyxl in c:\anaconda\lib\site-packages (3.1.5)Note: you may need to restart the kernel to use updated packages.

Collecting xlrd
  Downloading xlrd-2.0.1-py2.py3-none-any.whl.metadata (3.4 kB)
Requirement already satisfied: et-xmlfile in c:\anaconda\lib\site-packages (from openpyxl) (1.1.0)
Downloading xlrd-2.0.1-py2.py3-none-any.whl (96 kB)
Installing collected packages: xlrd
Successfully installed xlrd-2.0.1

In [201]:
xlsx = pd.ExcelFile("ex1.xlsx")

In [203]:
xlsx.sheet_names

['Sheet1']

In [205]:
xlsx.parse(sheet_name = "Sheet1")

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [207]:
xlsx.parse(sheet_name="Sheet1", index_col = 0)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [209]:
frame = pd.read_excel("ex1.xlsx", sheet_name = "Sheet1")
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [211]:
writer = pd.ExcelWriter("ex2.xlsx")
frame.to_excel(writer, "Sheet1")
writer.close()

C:\Users\JuhyunN\AppData\Local\Temp\ipykernel_5380\2440807760.py:2: FutureWarning: Starting with pandas version 3.0 all arguments of to_excel except for the argument 'excel_writer' will be keyword-only.
  frame.to_excel(writer, "Sheet1")

In [215]:
frame.to_excel("ex2.xlsx")

#### HDF5

In [220]:
pip install tables

Requirement already satisfied: tables in c:\anaconda\lib\site-packages (3.10.1)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: numpy>=1.20.0 in c:\anaconda\lib\site-packages (from tables) (1.26.4)
Requirement already satisfied: numexpr>=2.6.2 in c:\anaconda\lib\site-packages (from tables) (2.8.7)
Requirement already satisfied: packaging in c:\anaconda\lib\site-packages (from tables) (24.1)
Requirement already satisfied: py-cpuinfo in c:\anaconda\lib\site-packages (from tables) (9.0.0)
Requirement already satisfied: typing-extensions>=4.4.0 in c:\anaconda\lib\site-packages (from tables) (4.11.0)

In [222]:
frame = pd.DataFrame({"a":np.random.standard_normal(100)})
store = pd.HDFStore("mydata.h5")
store["obj1"] = frame
store["obj1col1"] = frame["a"]
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [224]:
store["obj1"]

           a
0  -0.204708
1   0.478943
2  -0.519439
3  -0.555730
4   1.965781
..       ...
95  0.795253
96  0.118110
97 -0.748532
98  0.584970
99  0.152677

[100 rows x 1 columns]

In [228]:
store.put("obj2", frame, format = "table")
store.select("obj2", where = ["index >= 10 and index <= 15"])

           a
10  1.007189
11 -1.296221
12  0.274992
13  0.228913
14  1.352917
15  0.886429

In [230]:
store.close()

In [234]:
frame.to_hdf("mydata.h5", "obj3", format = "table")
pd.read_hdf("mydata.h5", "obj3", where=["index<5"])

C:\Users\JuhyunN\AppData\Local\Temp\ipykernel_5380\4090850977.py:1: FutureWarning: Starting with pandas version 3.0 all arguments of to_hdf except for the argument 'path_or_buf' will be keyword-only.
  frame.to_hdf("mydata.h5", "obj3", format = "table")

          a
0 -0.204708
1  0.478943
2 -0.519439
3 -0.555730
4  1.965781

In [236]:
import os
os.remove("mydata.h5") #removing HDF5 file generated previously

#### Web API

In [239]:
pip install requests

Requirement already satisfied: requests in c:\anaconda\lib\site-packages (2.32.3)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\anaconda\lib\site-packages (from requests) (3.3.2)
Requirement already satisfied: idna<4,>=2.5 in c:\anaconda\lib\site-packages (from requests) (3.7)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\anaconda\lib\site-packages (from requests) (2.2.3)
Requirement already satisfied: certifi>=2017.4.17 in c:\anaconda\lib\site-packages (from requests) (2024.12.14)
Note: you may need to restart the kernel to use updated packages.

In [241]:
import requests

In [243]:
url = "https://api.github.com/repos/pandas-dev/pandas/issues"
resp = requests.get(url)
resp.raise_for_status()
resp

In [245]:
data = resp.json()
data[0]["title"]

'BUG: Concatenating dataframe and series with `ignore_index = True` drops the series name'

In [247]:
issues = pd.DataFrame(data,columns =["number", "title","labels","state"])
issues

,number,title,labels,state
0,60723,BUG: Concatenating dataframe and series with `ignore_index = True` drop...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ==', 'url': 'https://api.g...",open
1,60722,CI: Test Github Actions Arm64 Runners,"[{'id': 129350, 'node_id': 'MDU6TGFiZWwxMjkzNTA=', 'url': 'https://api....",open
2,60718,DOC: Whatsnew for sorting mode result,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OTk=', 'url': 'https://api....",open
3,60716,Update PyArrow conversion and arrow/parquet tests for pyarrow 19.0,"[{'id': 76865106, 'node_id': 'MDU6TGFiZWw3Njg2NTEwNg==', 'url': 'https:...",open
4,60714,BUG: why arrow only work on mac arm？,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ==', 'url': 'https://api.g...",open
...,...,...,...,...
25,60668,ENH: Add support for executing UDF's using Bodo as the engine,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg==', 'url': 'https://api.g...",open
26,60667,Implement String Accumulations with nanoarrow,[],open
27,60666,Update docs for generating unoptimized debug builds,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OTk=', 'url': 'https://api....",open
28,60664,"BUG: Pandas resets counter when using filterwarning ""once""","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ==', 'url': 'https://api.g...",open
29,60663,ENH: Enable pytables to round-trip with StringDtype,"[{'id': 47229190, 'node_id': 'MDU6TGFiZWw0NzIyOTE5MA==', 'url': 'https:...",open

#### Database

In [250]:
import sqlite3

In [252]:
query = """
CREATE TABLE test
(a VARCHR(20), b VARCHR(20),
 c REAL,       d INTEGER
 ); """

con = sqlite3.connect("mydata.sqlite")
con.execute(query)

In [254]:
con.commit()

In [256]:
data = [("Atlanta", "Georgia", 1.25, 6),
        ("Tallahassee", "Florida", 2.5, 3),
        ("Sacramento", "California", 1.7, 5)]

stmt = "INSERT INTO test VALUES(?,?,?,?)"
con.executemany(stmt, data)

In [258]:
con.commit()

In [260]:
cursor = con.execute("SELECT * FROM test")
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.5, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [262]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [264]:
pd.DataFrame(rows, columns = [x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.50  3
2   Sacramento  California  1.70  5

In [266]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\anaconda\lib\site-packages (2.0.34)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\anaconda\lib\site-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\anaconda\lib\site-packages (from sqlalchemy) (3.0.1)
Note: you may need to restart the kernel to use updated packages.

In [268]:
import sqlalchemy as sqla

In [274]:
db = sqla.create_engine("sqlite:///mydata.sqlite")
pd.read_sql("SELECT * FROM test", db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.50  3
2   Sacramento  California  1.70  5